# Pandas.DataFrame.pivot

In [1]:
import pandas as pd

## pd.DataFrame.pivot(*, index=None, columns=None, values=None)

Basically it returns a reshaped DataFrame organized by given index / column values.
> Reshape data (produce a “pivot” table) based on column values. Uses unique values from specified index / columns to form axes of the resulting DataFrame. This function does not support data aggregation, multiple values will result in a MultiIndex in the columns.

### Parameters:
>+ **index** : str or object or a list of str, optional
>> Column to use to make new frame’s index. If None, uses existing index.
>+ **columns** : str or object or a list of str
>> Column to use to make new frame’s columns.
>+ **values** : str, object or a list of the previous, optional
>> Column(s) to use for populating new frame’s values. If not specified, all remaining columns will be used and the result will have hierarchically indexed columns.
### Returns : DataFrame
>Column(s) to use for populating new frame’s values. If not specified, all remaining columns will be used and the result will have hierarchically indexed columns.
### Raises : ValueError
> When there are any index, columns combinations with multiple values. DataFrame.pivot_table when you need to aggregate.

In [5]:
 df = pd.DataFrame(
     {
         'foo': ['one', 'one', 'one', 'two', 'two','two'],
         'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
         'baz': [1, 2, 3, 4, 5, 6],
         'zoo': ['x', 'y', 'z', 'q', 'w', 't']
     }
 )
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [6]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [7]:
df.pivot(index='foo', columns='bar')['baz']

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [8]:
df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t